{
  "education": ["University of Virginia, Charlottesville, Virginia\nMaster of Science (G. 2026). Program: Data Science\nBachelor of Science (G. 2022). Major: Biomedical Engineering | Minor: Computer Science\n\n"],
  "experience": ["Data Visualization Engineer, Vedanta Biosciences (Contract)\n2025 — Current\n-    Process Dashboard:\n     -   Developed a probiotics manufacturing process dashboard using a React frontend and FastAPI backend\n     -   Implemented Mosaic and vgplot to enable real-time cross-filtering and linked selections across multiple coordinated views\n     -   Built interactive time-series and clustering visualizations tracking fermentation titer, projected recovery rates, and metabolite concentrations across dozens of batches\nBioinformatician, University of Virginia\n2024 — Current\n-    Software:\n     -    Contributed to React + TS frontend and Python FastAPI for lab software published by Sheffield Lab\n     -    Built PEPhub schema editor with versioning, tagging, and metadata management to allow for more structured validation of PEPs\n     -    Integrated Apple’s Embedding Atlas into BEDbase for interactive exploration of genomic region embedding space, enabling users to visually explore thousands of BED files or upload their own for comparison\n     -    Developed Refget SCOM interface to visualize comparisons between dozens of genomic sequence collections via Vega-Lite\n     -    Built Refgenie frontend interface to allow for browsing hundreds of reference genomes and associated assets visually\n     -    Wrote R bindings for gtars, a high-performance toolkit for genomic tools and algorithms written in Rust\n-    Research:\n     -   Analyzed ATACseq data of mouse HSC-myeloid cells to investigate how differentiation and aging impact gene accessibility\n     -   Performed sex-stratified GWAS study across TOPMed cohorts to investigate how sex contributes to COPD phenotypes\n     -   Colocalized above GWAS with sex-stratified pQTL results to identify causal SNPs linked to protein expression and COPD\n     -   Performed QC, clustering, and differential expression analyses on single cell RNA lung tissue samples using Seurat\n     -   Explored the interactive visualization of scRNAseq embeddings using Mosaic + vgplot and Embedding Atlas\nRotational Automation Engineer, Merck & Co. (Contract)\n2022 — 2025\n-    Data Visualization:\n     -   Helped lead automation community project incorporating R Shiny, plumber API, AWS, and PI Web API to automate manual continuous historian report writing process, eliminating the workload of 500+ reports written annually\n     -   Developed initial proof of concept for above tool that served as foundation for codebase\n     -   Built interactive Shiny dashboards incorporating Plotly and timevis plots to track concurrent batch events across 3 facilities\n     -   Worked on automated data pipelines that use R Markdown and PI Web API to manage factory data on AWS S3 and RDS\n     -   Designed real-time PI ProcessBook displays to help with real-time monitoring and investigations of manufacturing areas\nR&D Intern, Predictiv Care, Inc.\n2022 — 2024\n-    Pharmacogenomics (PGx) and VCF Annotation:\n     -   Used published CPIC guidelines to identify customer star alleles and drug metabolism phenotypes from customer variant call format files (WES and WGS)\n     -   Performed additional VCF file annotation with levels of pathogenicity and accompanying levels of clinical evidence for each matched variant with published ACMG and ClinGen guidelines\n-    Polygenic Risk Scores (PRS):\n     -   Wrote R scripts that incorporate published PRS models to calculate risk scores with customer VCF files\n     -   Reviewed LDpred2 and other algorithms to study established PRS model development practices\n\n"],
  "skills": ["Interfaces\n-    Frontend: React, React Router, TanStack Query, Zustand, TypeScript, JavaScript, HTML, CSS, Bootstrap\n-    Data Visualization: Vega-Lite, Mosaic/vgplot, Observable Plot, D3, Plotly, Plotly Dash, ggplot, timevis, Shiny\nInfrastructure\n-    Backend: FastAPI, plumber, SQL, DuckDB, AWS, Posit Connect\n-    Tools: Git, GitHub, Jupyter, R Markdown, Slurm\n-    Data Analysis: tidyverse, data.table, Seurat, DESeq2, GENESIS, SeqArray, coloc, susieR, Pandas, NumPy\n"]
}
